<html>
<head>
<meta http-equiv="Content-Type" content="text/HTML; charset=iso-8859-1"  />
</head>
<body>
<p><strong>Ejercicio 1) [Proyecto]</strong> Modifica el proyecto para que el servidor reciba la configuraci&oacute;n a trav&eacute;s de un objeto Properties. Por un lado, la clase es.uvigo.esei.dai.hybridserver.HybridServer deber&aacute; tener un constructor que reciba como &uacute;nico par&aacute;metro un objeto Properties y, por otro lado, la clase es.uvigo.esei.dai.hybridserver.Launcher deber&aacute; ser ejecutable y recibir como &uacute;nico par&aacute;metro la ruta de un fichero de configuraci&oacute;n. De este modo, el servidor se ejecutar&aacute; con: java es.uvigo.esei.dai.hybridserver.Launcher config.props</p>
<p>Recuerda que tanto HybridServer como Launcher deben poder trabajar con una configuraci&oacute;n por defecto, por lo que HybridServer deber&iacute;a tener un constructor vac&iacute;o y Launcher debe funcionar aunque no reciba la ruta de un fichero al ejecutarse.</p>
<p>Revisa el documento de <a href="http://cursos.faitic.uvigo.es/tema1415/claroline/document/goto/index.php/Proyecto/Aclaraciones_primera_entrega.htm?cidReq=O06G150V01962" title="Aclaraciones del Proyecto">aclaraciones del proyecto</a> para saber cual debe ser el contenido del fichero de configuraci&oacute;n y cual es la configuraci&oacute;n por defecto.</p>
<p><strong>Ejercicio 2) [Proyecto]</strong> Modifica el proyecto para sustituir el almacenamiento de las p&aacute;ginas web en un mapa por el almacenamiento en una base de datos. Cuando hagas esto, ten en cuenta lo siguiente:</p>
<ul>
<li>Si el sistema est&aacute; bien dise&ntilde;ado, la sustituci&oacute;n de la clase que almacenaba las p&aacute;ginas en un mapa por la nueva clase que las almacenar&aacute; en base de datos no deber&iacute;a suponer ning&uacute;n cambio en ninguna otra clase de la base de datos, salvo en aquella que crea las instancias de esta clase. Esto es lo mismo que lo visto en el Dojo 3.</li>
<li>La clase que almacena las p&aacute;ginas web en la base de datos no deber&iacute;a tener ninguna dependencia con una base de datos concreta. Es decir, el hecho de que utilice JavaDB, MySQL u otro SGBD no deber&iacute;a suponer ninguna modificaci&oacute;n en dicha clase. Para ello, lo m&aacute;s sencillo es que esta clase reciba el objeto Connection en el constructor o a trav&eacute;s de un <em>setter</em>.</li>
</ul>
<p><strong>Ejercicio 3)</strong> Crea una aplicaci&oacute;n que te permita gestionar una base de datos de personas. Al menos, deber&iacute;a permitir realizar altas, bajas y listar las personas de la base de datos. Para ello parte de cero (no reutilices ning&uacute;n c&oacute;digo del utilizado en los Dojos) e intenta estructurar la aplicaci&oacute;n lo mejor posible. Es importante que crees una clase que te permita representar la entidad Persona (del mismo modo que Employee representaba a la entidad empleado en el Dojo 3).</p>
<p><strong>Ejercicio 4)</strong> A&ntilde;ade a la aplicaci&oacute;n creada en el ejercicio 3 la capacidad de almacenar las mascotas de cada persona. Ten en cuenta que para ello deber&aacute;s crear la entidad Mascota y modificar la entidad Persona para que contenga las Mascotas de las que es propietario. Para ello, por ejemplo, la entidad Persona puede tener el m&eacute;todo "getMascotas():Set&lt;Mascota&gt;". Debes pensar muy bien como implementar los objetos DAO para que esto sea posible.</p>
<p><strong>Ejercicio 4)</strong> Extiende la aplicaci&oacute;n de los ejercicios 2 y 3 para que Mascota tambi&eacute;n tenga un m&eacute;todo "getAmo():Persona".</p>
<p><strong>Ejercicio 5)</strong> Abre el proyecto <a href="http://cursos.faitic.uvigo.es/tema1314/claroline/document/goto/index.php/Ejercicios/Transactions.zip?cidReq=O06G150V01_G150920" target="_blank" title="Proyecto Transactions">Transactions</a> en Eclipse y eval&uacute;a el efecto de los distintos tipos de aislamiento (isolation levels) en los problemas de las transacciones. Para ello vete a la clase TransactionExamples y ejec&uacute;tala modificando los valores de la constante ISOLATION_LEVEL. Completa una tabla como la vista en la p&aacute;gina 44 del tema 4 utilizando JavaDB y utilizando MySQL.</p>
<p>Ten en cuenta que es necesario incluir los drivers de la base de datos que vayas a utilizar.</p>
<!-- content: html tiny_mce --></body></html>